Revit 2027 API
ParameterTypeId.LinePattern Property
 "Line Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinePattern { get; }
Public Shared ReadOnly Property LinePattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinePattern {
	ForgeTypeId^ get ();
}
static member LinePattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace